// Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
int a = -9;
int b = -3;
if (a > b) Console.WriteLine("max = " + a + ", min = " + b);
else Console.WriteLine("max = " + b + ", min = " + a);